lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Lights/ZigbeeHaRgbwCeilingLight/ZigbeeHaRgbwCeilingLight.ino
struct PendingApsAck {
  bool active = false;
  uint16_t destinationShort = 0U;
  uint8_t counter = 0U;
  uint16_t clusterId = 0U;
  uint16_t profileId = 0U;
  uint8_t destinationEndpoint = 0U;
  uint8_t sourceEndpoint = 0U;
  uint8_t retriesRemaining = 0U;
  uint8_t payloadLength = 0U;
  uint8_t payload[96] = {0U};
  uint32_t deadlineMs = 0U;
};

struct RecentInboundAps {
  bool valid = false;
  uint16_t sourceShort = 0U;
  uint8_t counter = 0U;
  uint16_t clusterId = 0U;
  uint16_t profileId = 0U;
  uint8_t destinationEndpoint = 0U;
  uint8_t sourceEndpoint = 0U;
  uint8_t deliveryMode = 0U;
  uint32_t expiresMs = 0U;
};

static constexpr uint8_t kPendingApsAckSlots = 3U;
static PendingApsAck g_pendingApsAcks[kPendingApsAckSlots]{};
static RecentInboundAps g_recentInboundAps{};
static constexpr uint32_t kApsAckTimeoutMs = 900U;
static constexpr uint32_t kRecentInboundApsWindowMs = 4000U;
static constexpr uint8_t kApsAckRetryLimit = 2U;
static constexpr uint32_t kParentRxTurnaroundDelayUs = 6000U;
static constexpr ZigbeeLogicalType kDeviceLogicalType =
    (NRF54L15_CLEAN_ZIGBEE_ROUTER_DEVICE != 0)
        ? ZigbeeLogicalType::kRouter
        : ZigbeeLogicalType::kEndDevice;

void armInterviewGraceWindow();
bool interviewGraceActive(uint32_t nowMs);
void maybeReceiveDirectInterviewTraffic(uint32_t nowMs);
void clearPendingApsAck();
void clearPendingApsAckSlot(uint8_t slot);
void clearRecentInboundAps();

ZigbeeCommissioningPolicy commissioningPolicy() {
  ZigbeeCommissioningPolicy policy{};
  policy.primaryChannelMask =
      static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_PRIMARY_CHANNEL_MASK);
  policy.secondaryChannelMask =
      static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_SECONDARY_CHANNEL_MASK);
  policy.activeScanWindowMs =
      static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_ACTIVE_SCAN_WINDOW_MS);
  policy.associationResponseTimeoutMs = static_cast<uint32_t>(
      NRF54L15_CLEAN_ZIGBEE_ASSOCIATION_RESPONSE_TIMEOUT_MS);
  policy.associationPollListenMs =
      static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_ASSOCIATION_POLL_LISTEN_MS);
  policy.associationPollRetryDelayMs = static_cast<uint32_t>(
      NRF54L15_CLEAN_ZIGBEE_ASSOCIATION_POLL_RETRY_DELAY_MS);
  policy.coordinatorRealignmentTimeoutMs = static_cast<uint32_t>(
      NRF54L15_CLEAN_ZIGBEE_COORDINATOR_REALIGNMENT_TIMEOUT_MS);
  policy.nwkRejoinResponseTimeoutMs = static_cast<uint32_t>(
      NRF54L15_CLEAN_ZIGBEE_NWK_REJOIN_RESPONSE_TIMEOUT_MS);
  policy.preferredPanId = kPreferredPanId;
  policy.preferredExtendedPanId =
      (g_extendedPanId != 0U) ? g_extendedPanId
                              : kConfiguredPreferredExtendedPanId;
  policy.pinnedTrustCenterIeee =
      static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_TRUST_CENTER_IEEE);
  policy.allowWellKnownKey = (NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY != 0);
  policy.allowInstallCodeKey = (NRF54L15_CLEAN_ZIGBEE_USE_INSTALL_CODE != 0);
  policy.installCodeOnly =
      (NRF54L15_CLEAN_ZIGBEE_USE_INSTALL_CODE != 0) &&
      (NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY == 0);
  policy.requireEncryptedTransportKey =
      (NRF54L15_CLEAN_ZIGBEE_REQUIRE_ENCRYPTED_TRANSPORT_KEY != 0);
  policy.requireEncryptedUpdateDevice =
      (NRF54L15_CLEAN_ZIGBEE_ALLOW_DEMO_PLAINTEXT_TC_CMDS == 0);
  policy.requireEncryptedSwitchKey =
      (NRF54L15_CLEAN_ZIGBEE_ALLOW_DEMO_PLAINTEXT_TC_CMDS == 0);
  policy.requirePanCoordinator = false;
  policy.requireUniqueTrustCenterForRejoin = true;
  return policy;
}

void refreshCommissioningState() {
  g_network.policy = commissioningPolicy();
  g_network.preferredChannel = kPreferredChannel;
  g_network.preferredPanId = kPreferredPanId;
  g_network.defaultShort = kLightShort;
  g_network.coordinatorShort = kCoordinatorShort;
}

bool usesParentPolling() {
  return ZigbeeCommissioning::usesParentPolling(g_network);
}

uint8_t currentMacCapabilityFlags() { return g_device.macCapabilityFlags(); }

bool loadInstallCodeLinkKey(uint8_t outKey[16]) {
#if NRF54L15_CLEAN_ZIGBEE_USE_INSTALL_CODE
  return ZigbeeSecurity::deriveInstallCodeLinkKey(kInstallCode,
                                                  sizeof(kInstallCode), outKey);
#else
  (void)outKey;
  return false;
#endif
}

uint64_t expectedTrustCenterIeee() {
  refreshCommissioningState();
  return ZigbeeCommissioning::expectedTrustCenterIeee(g_network);
}

void applyDefaultReporting() {
  g_device.configureReporting(kZigbeeClusterOnOff, 0x0000U,
                              ZigbeeZclDataType::kBoolean, 0U, 30U, 0U);
  g_device.configureReporting(kZigbeeClusterLevelControl, 0x0000U,
                              ZigbeeZclDataType::kUint8, 0U, 30U, 16U);
#if NRF54L15_CLEAN_ZIGBEE_COLOR_LIGHT
  g_device.configureReporting(kZigbeeClusterColorControl, 0x0000U,
                              ZigbeeZclDataType::kUint8,
                              static_cast<uint16_t>(
                                  NRF54L15_CLEAN_ZIGBEE_HUE_REPORT_MIN_S),
                              static_cast<uint16_t>(
                                  NRF54L15_CLEAN_ZIGBEE_HUE_REPORT_MAX_S),
                              static_cast<uint32_t>(
                                  NRF54L15_CLEAN_ZIGBEE_HUE_REPORT_CHANGE));
  g_device.configureReporting(kZigbeeClusterColorControl, 0x0001U,
                              ZigbeeZclDataType::kUint8,
                              static_cast<uint16_t>(
                                  NRF54L15_CLEAN_ZIGBEE_HUE_REPORT_MIN_S),
                              static_cast<uint16_t>(
                                  NRF54L15_CLEAN_ZIGBEE_HUE_REPORT_MAX_S),
                              static_cast<uint32_t>(
                                  NRF54L15_CLEAN_ZIGBEE_SATURATION_REPORT_CHANGE));
#if NRF54L15_CLEAN_ZIGBEE_COLOR_TEMPERATURE
  g_device.configureReporting(
      kZigbeeClusterColorControl, 0x0007U, ZigbeeZclDataType::kUint16,
      static_cast<uint16_t>(
          NRF54L15_CLEAN_ZIGBEE_COLOR_TEMPERATURE_REPORT_MIN_S),
      static_cast<uint16_t>(
          NRF54L15_CLEAN_ZIGBEE_COLOR_TEMPERATURE_REPORT_MAX_S),
      static_cast<uint32_t>(
          NRF54L15_CLEAN_ZIGBEE_COLOR_TEMPERATURE_REPORT_CHANGE));
#endif
#endif
}

