lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Lights/ZigbeeHaRgbwCeilingLight/ZigbeeHaRgbwCeilingLight.ino
  if (aps.profileId == kZigbeeProfileZdo) {
    if (aps.deliveryMode == kZigbeeApsDeliveryUnicast && aps.ackRequested) {
      delayMicroseconds(kParentRxTurnaroundDelayUs);
      (void)sendApsAcknowledgement(nwk.sourceShort, aps);
    }
    if (duplicateAps) {
      Serial.print("aps_dup cluster=0x");
      Serial.print(aps.clusterId, HEX);
      Serial.print(" src=0x");
      Serial.print(nwk.sourceShort, HEX);
      Serial.print("\r\n");
      return;
    }
    rememberRecentInboundAps(nwk.sourceShort, aps);
    uint16_t responseClusterId = 0U;
    uint8_t responsePayload[127] = {0U};
    uint8_t responseLength = 0U;
    if (g_device.handleZdoRequest(aps.clusterId, aps.payload, aps.payloadLength,
                                  &responseClusterId, responsePayload,
                                  &responseLength) &&
        responseLength > 0U) {
      (void)sendApsFrame(nwk.sourceShort, 0U, responseClusterId,
                         kZigbeeProfileZdo, 0U, responsePayload, responseLength);
      uint8_t leaveFlags = 0U;
      if (g_device.consumeLeaveRequest(&leaveFlags)) {
        handleAcceptedLeaveRequest(leaveFlags);
      }
    }
    return;
  }

  const bool targetsLocalEndpoint =
      (aps.deliveryMode == kZigbeeApsDeliveryUnicast &&
       aps.destinationEndpoint == kLocalEndpoint) ||
      (aps.deliveryMode == kZigbeeApsDeliveryGroup &&
       g_device.isInGroup(aps.destinationGroup));
  if (aps.profileId != kZigbeeProfileHomeAutomation || !targetsLocalEndpoint) {
    return;
  }
  if (aps.deliveryMode == kZigbeeApsDeliveryUnicast && aps.ackRequested) {
    delayMicroseconds(kParentRxTurnaroundDelayUs);
    (void)sendApsAcknowledgement(nwk.sourceShort, aps);
  }
  if (duplicateAps) {
    Serial.print("aps_dup cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print(" src=0x");
    Serial.print(nwk.sourceShort, HEX);
    Serial.print("\r\n");
    return;
  }
  rememberRecentInboundAps(nwk.sourceShort, aps);

  uint8_t responseFrame[127] = {0U};
  uint8_t responseLength = 0U;
  if (!g_device.handleZclRequest(aps.clusterId, aps.payload, aps.payloadLength,
                                 responseFrame, &responseLength)) {
    return;
  }

  g_savedOnOffState = g_device.onOff();
  g_savedLevelState = g_device.level();
  applyLedState();
  persistState();
  Serial.print("zcl cluster=0x");
  Serial.print(aps.clusterId, HEX);
  Serial.print(" onoff=");
  Serial.print(g_device.onOff() ? "ON" : "OFF");
  Serial.print(" level=");
  Serial.print(g_device.level());
  Serial.print("\r\n");

  if (responseLength > 0U &&
      aps.deliveryMode == kZigbeeApsDeliveryUnicast) {
    delayMicroseconds(kParentRxTurnaroundDelayUs);
    (void)sendApsFrame(nwk.sourceShort, aps.sourceEndpoint, aps.clusterId,
                       aps.profileId, aps.destinationEndpoint, responseFrame,
                       responseLength);
  }
}

void pollCoordinator() {
  refreshCommissioningState();
  if (!ZigbeeCommissioning::shouldPollParent(g_network)) {
    return;
  }

  uint8_t request[127] = {0U};
  uint8_t requestLength = 0U;
  const bool joinedPoll = g_joined;
  const bool built =
      joinedPoll
          ? ZigbeeCodec::buildDataRequestShort(g_macSequence++, g_panId,
                                               g_parentShort, g_localShort,
                                               request, &requestLength)
          : ZigbeeCodec::buildDataRequest(g_macSequence++, g_panId,
                                          g_parentShort, kIeeeAddress, request,
                                          &requestLength);
  if (!built) {
    return;
  }
  ZigbeeFrame frame{};
  if (g_radio.transmitThenReceive(request, requestLength, &frame, 12000U, false,
                                  1200000UL)) {
    processIncomingFrame(frame);
  }

  const uint32_t followupWindowStartUs = micros();
  while (static_cast<uint32_t>(micros() - followupWindowStartUs) <
         static_cast<uint32_t>(
             NRF54L15_CLEAN_ZIGBEE_PARENT_POLL_FOLLOWUP_LISTEN_US)) {
    const uint32_t elapsedUs =
        static_cast<uint32_t>(micros() - followupWindowStartUs);
    const uint32_t remainingUs =
        (elapsedUs <
         static_cast<uint32_t>(
             NRF54L15_CLEAN_ZIGBEE_PARENT_POLL_FOLLOWUP_LISTEN_US))
            ? (static_cast<uint32_t>(
                   NRF54L15_CLEAN_ZIGBEE_PARENT_POLL_FOLLOWUP_LISTEN_US) -
               elapsedUs)
            : 0U;
    if (remainingUs == 0U) {
      break;
    }
    if (!g_radio.receive(&frame, remainingUs, 350000UL)) {
      continue;
    }
    processIncomingFrame(frame);
  }
}

void maybeSendScheduledReports(uint32_t nowMs) {
  if (!g_joined) {
    return;
  }

  while (sendDueAttributeReport(nowMs, nullptr)) {
  }
}

void armInterviewGraceWindow() {
  g_interviewGraceUntilMs =
      millis() + static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_INTERVIEW_GRACE_MS);
}

bool interviewGraceActive(uint32_t nowMs) {
  return static_cast<int32_t>(g_interviewGraceUntilMs - nowMs) > 0;
}

void maybeReceiveDirectInterviewTraffic(uint32_t nowMs) {
  const bool directCommissioning =
      g_network.state == ZigbeeCommissioningState::kWaitingTransportKey ||
      g_network.state == ZigbeeCommissioningState::kWaitingUpdateDevice ||
      g_network.state == ZigbeeCommissioningState::kRejoinVerify;
  if (!(interviewGraceActive(nowMs) ||
        (!usesParentPolling() && (directCommissioning || g_joined)))) {
    return;
  }

  const uint32_t listenUs =
      interviewGraceActive(nowMs)
          ? static_cast<uint32_t>(
                NRF54L15_CLEAN_ZIGBEE_INTERVIEW_DIRECT_LISTEN_US)
          : static_cast<uint32_t>(
                NRF54L15_CLEAN_ZIGBEE_ROUTER_IDLE_LISTEN_US);

  ZigbeeFrame frame{};
  if (!g_radio.receive(&frame, listenUs, 350000UL)) {
    return;
  }
  processIncomingFrame(frame);
}

void handleSerialCommands() {
  while (Serial.available() > 0) {
    const int ch = Serial.read();
    if (ch == 't') {
      g_savedOnOffState = !g_device.onOff();
      (void)g_device.setOnOff(g_savedOnOffState);
      g_savedLevelState = g_device.level();
      applyLedState();
      persistState();
      Serial.print("toggle onoff=");
      Serial.print(g_device.onOff() ? "ON" : "OFF");
      Serial.print(" level=");
      Serial.print(g_device.level());
      Serial.print("\r\n");
    } else if (ch == 'U' || ch == 'D' || ch == 'M') {
      uint16_t nextLevel = g_device.level();
      if (ch == 'U') {
        nextLevel = static_cast<uint16_t>(nextLevel) + 32U;
      } else if (ch == 'D') {
        nextLevel = (nextLevel > 32U) ? static_cast<uint16_t>(nextLevel - 32U) : 1U;
      } else {
        nextLevel = 128U;
      }
      if (nextLevel > 0xFEU) {
        nextLevel = 0xFEU;
      }
      (void)g_device.setLevel(static_cast<uint8_t>(nextLevel));
      g_savedOnOffState = g_device.onOff();
      g_savedLevelState = g_device.level();
      applyLedState();
      persistState();
      Serial.print("level=");
      Serial.print(g_device.level());
      Serial.print(" onoff=");
      Serial.print(g_device.onOff() ? "ON" : "OFF");
      Serial.print("\r\n");
    } else if (ch == 'r') {
      const bool onOffOk = sendAttributeReport(kZigbeeClusterOnOff);
      const bool levelOk = sendAttributeReport(kZigbeeClusterLevelControl);
      Serial.print("report onoff=");
      Serial.print(onOffOk ? "OK" : "FAIL");
      Serial.print(" level=");
      Serial.print(levelOk ? "OK" : "FAIL");
#if NRF54L15_CLEAN_ZIGBEE_COLOR_LIGHT
      const bool colorOk = sendAttributeReport(kZigbeeClusterColorControl);
      Serial.print(" color=");
      Serial.print(colorOk ? "OK" : "FAIL");
#endif
      Serial.print("\r\n");
    } else if (ch == 'j') {
      const ZigbeeCommissioningStartRequest request =
          requestCommissioningStart();
      if (request == ZigbeeCommissioningStartRequest::kSecureRejoin) {
        Serial.print("secure_rejoin requested\r\n");
      } else if (request ==
                 ZigbeeCommissioningStartRequest::kNetworkSteering) {
        Serial.print("network_steering requested\r\n");
      } else {
        Serial.print("commissioning request ignored\r\n");
      }
    } else if (ch == 'c') {
      clearJoinState(true);
      Serial.print("state cleared\r\n");
    } else if (ch == 's') {
      Serial.print("state joined=");
      Serial.print(g_joined ? "yes" : "no");
      Serial.print(" mode=");
      Serial.print(ZigbeeCommissioning::stateName(g_network.state));
      Serial.print(" failure=");
      Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
      Serial.print(" join_attempts=");
      Serial.print(g_network.joinAttempts);
      Serial.print(" rejoin_attempts=");
      Serial.print(g_network.rejoinAttempts);
      Serial.print(" ch=");
      Serial.print(g_channel);
      Serial.print(" pan=0x");
      Serial.print(g_panId, HEX);
      Serial.print(" short=0x");
      Serial.print(g_localShort, HEX);
      Serial.print(" nwk_seq=");
      Serial.print(g_haveActiveNetworkKey ? g_activeNetworkKeySequence : 0U);
      Serial.print(" alt_seq=");
      Serial.print(g_haveAlternateNetworkKey ? g_alternateNetworkKeySequence
                                             : 0U);
      Serial.print(" poll_ms=");
      Serial.print(g_parentPollIntervalMs);
      Serial.print(" onoff=");
      Serial.print(g_device.onOff() ? "ON" : "OFF");
      Serial.print(" level=");
      Serial.print(g_device.level());
      Serial.print("\r\n");
    }
  }
}

}  // namespace

void setup() {
  Serial.begin(115200);
  delay(300);

  if (g_localIeee == 0U) {
    g_localIeee = zigbeeFactoryEui64();
  }

  g_pwmReady = g_pwm20.beginSingle(kPinUserLed, 1000UL, 0U, false) &&
               g_pwm20.start(0, 200000UL);
  if (!g_pwmReady) {
    (void)Gpio::configure(kPinUserLed, GpioDirection::kOutput,
                          GpioPull::kDisabled);
  }

  g_store.begin("zbjoindm");
  restoreState();

